app/controllers/products_controller.rb

	def index
		@products = Product.all.page(params[:page]).per(3)
---
SELECT  `products`.* FROM `products` LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `products`

	def send_mail
		@product = Product.all
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (SELECT `products`.`id` FROM `products`)

	def create
		@product = Product.new(product_params)

		respond_to do |prdct|
			if @product.save
---
INSERT INTO `products` (`title`, `price`, `quantity`, `vat`, `description`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `totol_price`, `product_id`, `created_at`, `updated_at`) VALUES ('aaa', 10, '2g', '2', 'a aa aaa', 'sec2-3.jpg', 'image/jpeg', 29605, '2016-06-24 08:54:15', 12, 'PDCT-1001', '2016-06-24 08:54:15', '2016-06-24 08:54:15')

	def update
	    respond_to do |prdct|
	      if @product.update(product_params)
---
UPDATE `products` SET `image_file_name` = 'sec2-2.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 24148, `image_updated_at` = '2016-06-24 07:34:39', `product_id` = 'PDCT-1006', `updated_at` = '2016-06-24 07:34:39' WHERE `products`.`id` = 42

    def set_product
      @product = Product.find(params[:id])
      @product = Product.all
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT `products`.* FROM `products`